In [4]:
import numpy as np
import pandas as pd

In [6]:
# Data Frame 정의하기
# 이전에 DataFrame에 들어갈 데이터를 정의해주어야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [8]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
val = df.values
print(val[0])
print(type(val))
print(val[1][2])

['Beomwoo' 2013 1.5]
<class 'numpy.ndarray'>
1.7

In [19]:
# DataFrame을 만들면서 columns와 index를 설정할 수 있다.
df2 = pd.DataFrame(data, columns=['year', 'name', 'points', 'penalty'],
                  index=['one', 'two', 'three', 'four', 'five'])
df2

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [21]:
df2.describe() # 기초통계를 계산해서 그 결과를 리턴한다.

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

In [23]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
           "year": [2014, 2015, 2016, 2015, 2016],
           "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [43]:
data_s = df['year']
data_s['two']

2015

In [48]:
df.year['three']

2016

In [50]:
type(df)

pandas.core.frame.DataFrame

In [52]:
df[['year', 'points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [55]:
df.penalty = 0.5
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [57]:
df.penalty.sum()

2.5

In [59]:
df.points.sum()

12.100000000000001

In [61]:
df.penalty.mean()

0.5

In [65]:
df.penalty = [0.1, 0.2, 0.3, 0.4, 0.5]
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [68]:
df['zeros'] = np.arange(1, 6)
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      1
two    2015    Kilho     1.7      0.2      2
three  2016    Kilho     3.6      0.3      3
four   2015  Charles     2.4      0.4      4
five   2016  Charles     2.9      0.5      5

In [70]:
# 데이터 프레임 행단위 참조 방법
# 1. 행 인덱스
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      1
two    2015    Kilho     1.7      0.2      2
three  2016    Kilho     3.6      0.3      3
four   2015  Charles     2.4      0.4      4
five   2016  Charles     2.9      0.5      5

In [76]:
df[0:1]

     year  names  points  penalty  zeros
one  2014  Kilho     1.5      0.1      1

In [78]:
df[1:2]

     year  names  points  penalty  zeros
two  2015  Kilho     1.7      0.2      2

In [82]:
df[1:]

       year    names  points  penalty  zeros
two    2015    Kilho     1.7      0.2      2
three  2016    Kilho     3.6      0.3      3
four   2015  Charles     2.4      0.4      4
five   2016  Charles     2.9      0.5      5

In [86]:
df['one':'one']

     year  names  points  penalty  zeros
one  2014  Kilho     1.5      0.1      1

In [88]:
df[0:0]

Empty DataFrame
Columns: [year, names, points, penalty, zeros]
Index: []

In [90]:
df['one':'five']

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      1
two    2015    Kilho     1.7      0.2      2
three  2016    Kilho     3.6      0.3      3
four   2015  Charles     2.4      0.4      4
five   2016  Charles     2.9      0.5      5

In [94]:
# 행접근 속성 : loc(인덱스 문자이름), iloc(숫자)
df.loc['three']

year        2016
names      Kilho
points       3.6
penalty      0.3
zeros          3
Name: three, dtype: object

In [96]:
df.iloc[2]

year        2016
names      Kilho
points       3.6
penalty      0.3
zeros          3
Name: three, dtype: object

In [98]:
df.loc['three']['year']

2016

In [104]:
df4 = df.loc[:,['year', 'names']]
df4

       year    names
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

In [105]:
print(type(df4))

<class 'pandas.core.frame.DataFrame'>

In [108]:
df5 = df.loc[:,'year']
df5

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [110]:
type(df5)

pandas.core.series.Series

In [118]:
mask_year_2016 = df['year'] >= 2016

In [120]:
# 가입년도가 2016년 이후인 모든 회원의 정보를 출력하시오.
df.loc[mask_year_2016,:]

       year    names  points  penalty  zeros
three  2016    Kilho     3.6      0.3      3
five   2016  Charles     2.9      0.5      5

In [122]:
df6 = df.loc[mask_year_2016,:]
df6.describe()

         year    points   penalty     zeros
count     2.0  2.000000  2.000000  2.000000
mean   2016.0  3.250000  0.400000  4.000000
std       0.0  0.494975  0.141421  1.414214
min    2016.0  2.900000  0.300000  3.000000
25%    2016.0  3.075000  0.350000  3.500000
50%    2016.0  3.250000  0.400000  4.000000
75%    2016.0  3.425000  0.450000  4.500000
max    2016.0  3.600000  0.500000  5.000000

In [124]:
df.sum()

year                               10076
names      KilhoKilhoKilhoCharlesCharles
points                              12.1
penalty                              1.5
zeros                                 15
dtype: object

In [126]:
df.sum(axis = 1)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_1452\1830824671.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum(axis = 1)

one      2016.6
two      2018.9
three    2022.9
four     2021.8
five     2024.4
dtype: float64